app/Modules/Queue/Libraries/QueueService.php

SELECT COUNT(*) AS `numrows`
FROM `handovers`
WHERE `status` = 'Cleared'
AND `updated_at` >= '2026-05-21 00:00:00'
AND `updated_at` <= '2026-05-21 23:59:59'
SELECT *
FROM `handovers`
WHERE `status` = 'Cleared'
AND `updated_at` >= '2026-05-21 00:00:00'
AND `updated_at` <= '2026-05-21 23:59:59'
---
    private function _computeMetrics(array $active_queue): array
    {
        // 1. Count active ambulances in queue
        $ambulances_in_queue = count($active_queue);

        // 2. Count completed handovers today (status = Cleared, updated today)
        $today_start = date('Y-m-d 00:00:00');
        $today_end = date('Y-m-d 23:59:59');

        $completed_today_count = $this->_handover_model
            ->where('status', 'Cleared')
            ->where('updated_at >=', $today_start)
            ->where('updated_at <=', $today_end)
            ->countAllResults();

        // 3. Calculate average wait time today (active + completed today)
        $total_wait_minutes = 0;
        $total_records = 0;

        foreach ($active_queue as $handover) {
            $total_wait_minutes += (int) $handover->wait_time_minutes;
            $total_records++;
        }

        $completed_today_records = $this->_handover_model
            ->where('status', 'Cleared')
            ->where('updated_at >=', $today_start)
            ->where('updated_at <=', $today_end)
            ->findAll();