app/Modules/Queue/Models/HandoverModel.php

    public function getActiveQueue(): array
    {
        return $this->select('handovers.id, handovers.ambulance_id, handovers.hospital_id, handovers.patient_age, handovers.patient_gender, handovers.acuity, handovers.eta_minutes, handovers.wait_time_minutes, handovers.status, handovers.created_at, ambulances.unit_id, ambulances.provider, hospitals.name as hospital_name, hospitals.code as hospital_code')
            ->join('ambulances', 'ambulances.id = handovers.ambulance_id')
            ->join('hospitals', 'hospitals.id = handovers.hospital_id')
            ->where('handovers.status !=', 'Cleared')
            ->orderBy('CASE WHEN handovers.status = "Arrived" THEN 1 WHEN handovers.status = "Preparing" THEN 2 WHEN handovers.status = "Acknowledged" THEN 3 ELSE 4 END', 'ASC', false)
            ->orderBy('handovers.wait_time_minutes', 'DESC')
            ->findAll();
---
SELECT `handovers`.*, `ambulances`.`unit_id`, `ambulances`.`provider`, `hospitals`.`name` as `hospital_name`, `hospitals`.`code` as `hospital_code`
FROM `handovers`
JOIN `ambulances` ON `ambulances`.`id` = `handovers`.`ambulance_id`
JOIN `hospitals` ON `hospitals`.`id` = `handovers`.`hospital_id`
WHERE `handovers`.`status` != 'Cleared'
ORDER BY CASE WHEN handovers.status = "Arrived" THEN 1 WHEN handovers.status = "Preparing" THEN 2 WHEN handovers.status = "Acknowledged" THEN 3 ELSE 4 END ASC, `handovers`.`wait_time_minutes` DESC